#### Terraform Format and Style 
#### Terraform Initialization 
#### Terraform Validation 
#### Terraform Plan 📄

<details><summary>Show Plan</summary>

```hcl
module.lambda_iam.data.aws_iam_policy_document.lambda_assume: Reading...
module.lambda_iam.data.aws_iam_policy_document.lambda_assume: Read complete after 0s [id=2690255455]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lambda_permission.apigw will be created
  + resource "aws_lambda_permission" "apigw" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "demo-lambda-appgw-default-handler"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.apigateway.aws_api_gateway_account.this[0] will be created
  + resource "aws_api_gateway_account" "this" {
      + api_key_version     = (known after apply)
      + cloudwatch_role_arn = (known after apply)
      + features            = (known after apply)
      + id                  = (known after apply)
      + throttle_settings   = (known after apply)
    }

  # module.apigateway.aws_api_gateway_deployment.this will be created
  + resource "aws_api_gateway_deployment" "this" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = (known after apply)
    }

  # module.apigateway.aws_api_gateway_integration.lambda_integration will be created
  + resource "aws_api_gateway_integration" "lambda_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.apigateway.aws_api_gateway_method.get_method will be created
  + resource "aws_api_gateway_method" "get_method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.apigateway.aws_api_gateway_method_settings.this will be created
  + resource "aws_api_gateway_method_settings" "this" {
      + id          = (known after apply)
      + method_path = "orders/GET"
      + rest_api_id = (known after apply)
      + stage_name  = "prod"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = true
          + logging_level                              = "ERROR"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = 100
          + throttling_rate_limit                      = 50
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.apigateway.aws_api_gateway_resource.my_resource will be created
  + resource "aws_api_gateway_resource" "my_resource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "orders"
      + rest_api_id = (known after apply)
    }

  # module.apigateway.aws_api_gateway_rest_api.this will be created
  + resource "aws_api_gateway_rest_api" "this" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "API Gateway for demo-lambda-appgw"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "demo-lambda-appgw-api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "hello-world-lambda"
        }

      + endpoint_configuration {
          + ip_address_type  = (known after apply)
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.apigateway.aws_api_gateway_stage.this will be created
  + resource "aws_api_gateway_stage" "this" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + description   = "Stage for demo-lambda-appgw"
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "prod"
      + tags_all      = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "hello-world-lambda"
        }
      + web_acl_arn   = (known after apply)
    }

  # module.apigateway.aws_iam_role.api_gateway_cloudwatch[0] will be created
  + resource "aws_iam_role" "api_gateway_cloudwatch" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo-lambda-appgw-api-api-gw-cloudwatch-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "hello-world-lambda"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.apigateway.aws_iam_role_policy_attachment.api_gateway_cloudwatch[0] will be created
  + resource "aws_iam_role_policy_attachment" "api_gateway_cloudwatch" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonAPIGatewayPushToCloudWatchLogs"
      + role       = "demo-lambda-appgw-api-api-gw-cloudwatch-role"
    }

  # module.cloudwatch.aws_cloudwatch_dashboard.main will be created
  + resource "aws_cloudwatch_dashboard" "main" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (known after apply)
      + dashboard_name = "demo-lambda-appgw-dashboard"
      + id             = (known after apply)
    }

  # module.cloudwatch.aws_cloudwatch_log_group.api_gateway will be created
  + resource "aws_cloudwatch_log_group" "api_gateway" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "hello-world-lambda"
        }
    }

  # module.cloudwatch.aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/demo-lambda-appgw-default-handler"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "hello-world-lambda"
        }
    }

  # module.ecr.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 5 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 5
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "demo-lambda-appgw-default"
    }

  # module.ecr.aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "demo-lambda-appgw-default"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "hello-world-lambda"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.lambda.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "demo-lambda-appgw-default-handler"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "hello-world-lambda"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + image_config {
          + command = [
              + "app.lambda_handler",
            ]
        }

      + logging_config (known after apply)

      + tracing_config (known after apply)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = (known after apply)
          + subnet_ids                  = (known after apply)
          + vpc_id                      = (known after apply)
        }
    }

  # module.lambda_iam.aws_iam_policy.lambda_apigateway will be created
  + resource "aws_iam_policy" "lambda_apigateway" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Permissions for Lambda to integrate with API Gateway"
      + id               = (known after apply)
      + name             = "demo-lambda-appgw-lambda-apigateway"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "hello-world-lambda"
        }
    }

  # module.lambda_iam.aws_iam_policy.lambda_cloudwatch will be created
  + resource "aws_iam_policy" "lambda_cloudwatch" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Enhanced CloudWatch permissions for Lambda"
      + id               = (known after apply)
      + name             = "demo-lambda-appgw-lambda-cloudwatch"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "hello-world-lambda"
        }
    }

  # module.lambda_iam.aws_iam_policy.lambda_ecr_access will be created
  + resource "aws_iam_policy" "lambda_ecr_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow Lambda to access ECR images"
      + id               = (known after apply)
      + name             = "demo-lambda-appgw-lambda-ecr-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "hello-world-lambda"
        }
    }

  # module.lambda_iam.aws_iam_role.lambda_exec will be created
  + resource "aws_iam_role" "lambda_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo-lambda-appgw-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "hello-world-lambda"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.lambda_iam.aws_iam_role_policy_attachment.lambda_apigateway will be created
  + resource "aws_iam_role_policy_attachment" "lambda_apigateway" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "demo-lambda-appgw-lambda-role"
    }

  # module.lambda_iam.aws_iam_role_policy_attachment.lambda_basic will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "demo-lambda-appgw-lambda-role"
    }

  # module.lambda_iam.aws_iam_role_policy_attachment.lambda_cloudwatch will be created
  + resource "aws_iam_role_policy_attachment" "lambda_cloudwatch" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "demo-lambda-appgw-lambda-role"
    }

  # module.lambda_iam.aws_iam_role_policy_attachment.lambda_ecr_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "lambda_ecr_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "demo-lambda-appgw-lambda-role"
    }

  # module.lambda_iam.aws_iam_role_policy_attachment.lambda_vpc will be created
  + resource "aws_iam_role_policy_attachment" "lambda_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "demo-lambda-appgw-lambda-role"
    }

  # module.nat.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "demo-lambda-appgw-vpc-dev-nat-eip-0"
        }
      + tags_all             = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-lambda-appgw-vpc-dev-nat-eip-0"
          + "Project"     = "hello-world-lambda"
        }
      + vpc                  = (known after apply)
    }

  # module.nat.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "demo-lambda-appgw-vpc-dev-nat-eip-1"
        }
      + tags_all             = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-lambda-appgw-vpc-dev-nat-eip-1"
          + "Project"     = "hello-world-lambda"
        }
      + vpc                  = (known after apply)
    }

  # module.nat.aws_nat_gateway.demo-natgw[0] will be created
  + resource "aws_nat_gateway" "demo-natgw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "demo-lambda-appgw-vpc-dev-nat-gw-0"
        }
      + tags_all                           = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-lambda-appgw-vpc-dev-nat-gw-0"
          + "Project"     = "hello-world-lambda"
        }
    }

  # module.nat.aws_nat_gateway.demo-natgw[1] will be created
  + resource "aws_nat_gateway" "demo-natgw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "demo-lambda-appgw-vpc-dev-nat-gw-1"
        }
      + tags_all                           = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-lambda-appgw-vpc-dev-nat-gw-1"
          + "Project"     = "hello-world-lambda"
        }
    }

  # module.nat.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.network.aws_internet_gateway.demo-igw will be created
  + resource "aws_internet_gateway" "demo-igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "demo-lambda-appgw-vpc-dev-igw"
        }
      + tags_all = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-lambda-appgw-vpc-dev-igw"
          + "Project"     = "hello-world-lambda"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.aws_route_table.private-routing-table will be created
  + resource "aws_route_table" "private-routing-table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "demo-lambda-appgw-vpc-Private-RT"
          + "environment" = "Dev"
        }
      + tags_all         = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-lambda-appgw-vpc-Private-RT"
          + "Project"     = "hello-world-lambda"
          + "environment" = "Dev"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.public-routing-table will be created
  + resource "aws_route_table" "public-routing-table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name"        = "demo-lambda-appgw-vpc-Public-RT"
          + "environment" = "Dev"
        }
      + tags_all         = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-lambda-appgw-vpc-Public-RT"
          + "Project"     = "hello-world-lambda"
          + "environment" = "Dev"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table_association.private-subnets[0] will be created
  + resource "aws_route_table_association" "private-subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private-subnets[1] will be created
  + resource "aws_route_table_association" "private-subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public-subnets[0] will be created
  + resource "aws_route_table_association" "public-subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public-subnets[1] will be created
  + resource "aws_route_table_association" "public-subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_security_group.lambda_sg will be created
  + resource "aws_security_group" "lambda_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for Lambda functions"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "demo-lambda-default-lambda-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "demo-lambda-lambda-sg"
        }
      + tags_all               = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-lambda-lambda-sg"
          + "Project"     = "hello-world-lambda"
        }
      + vpc_id                 = (known after apply)
    }

  # module.network.aws_security_group_rule.lambda_egress will be created
  + resource "aws_security_group_rule" "lambda_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.network.aws_subnet.private-subnets[0] will be created
  + resource "aws_subnet" "private-subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "demo-lambda-appgw-vpc-Private-Subnet-1"
          + "environment" = "Dev"
        }
      + tags_all                                       = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-lambda-appgw-vpc-Private-Subnet-1"
          + "Project"     = "hello-world-lambda"
          + "environment" = "Dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private-subnets[1] will be created
  + resource "aws_subnet" "private-subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "demo-lambda-appgw-vpc-Private-Subnet-2"
          + "environment" = "Dev"
        }
      + tags_all                                       = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-lambda-appgw-vpc-Private-Subnet-2"
          + "Project"     = "hello-world-lambda"
          + "environment" = "Dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public-subnets[0] will be created
  + resource "aws_subnet" "public-subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "demo-lambda-appgw-vpc-Public-Subnet-1"
          + "environment" = "Dev"
        }
      + tags_all                                       = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-lambda-appgw-vpc-Public-Subnet-1"
          + "Project"     = "hello-world-lambda"
          + "environment" = "Dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public-subnets[1] will be created
  + resource "aws_subnet" "public-subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "demo-lambda-appgw-vpc-Public-Subnet-2"
          + "environment" = "Dev"
        }
      + tags_all                                       = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-lambda-appgw-vpc-Public-Subnet-2"
          + "Project"     = "hello-world-lambda"
          + "environment" = "Dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_vpc.demo-vpc will be created
  + resource "aws_vpc" "demo-vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"        = "demo-lambda-appgw-vpc-dev"
          + "Owner"       = "demo-lambda-appgw"
          + "environment" = "Dev"
        }
      + tags_all                             = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-lambda-appgw-vpc-dev"
          + "Owner"       = "demo-lambda-appgw"
          + "Project"     = "hello-world-lambda"
          + "environment" = "Dev"
        }
    }

Plan: 45 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_gateway_execution_arn  = (known after apply)
  + api_gateway_id             = (known after apply)
  + api_gateway_invoke_url     = (known after apply)
  + api_gateway_log_group_name = (known after apply)
  + api_gateway_stage_name     = "prod"
  + base_url                   = (known after apply)
  + cloudwatch_dashboard_arn   = (known after apply)
  + ecr_repository_arn         = (known after apply)
  + ecr_repository_url         = (known after apply)
  + lambda_execution_role_arn  = (known after apply)
  + lambda_function_arn        = (known after apply)
  + lambda_function_name       = "demo-lambda-appgw-default-handler"
  + lambda_invoke_arn          = (known after apply)
  + lambda_log_group_name      = "/aws/lambda/demo-lambda-appgw-default-handler"
  + private_subnet_ids         = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids          = [
      + (known after apply),
      + (known after apply),
    ]
  + vpc_id                     = (known after apply)
```

</details>

*Pushed by: @devops979, Action: `pull_request`*